app/Models/categoria_Model.php

SELECT *
FROM `producto`
JOIN `producto_categoria` ON `producto_categoria`.`categoria_id` = `producto`.`producto_categoria`
---
    public function productoCategoria()
	{
		$db = \Config\Database::connect();
		$builder = $db->table('producto');
		$builder->select('*');
		$builder->join('producto_categoria', 'producto_categoria.categoria_id = producto.producto_categoria');
		$query = $builder->get();