app/Models/producto_Model.php

SELECT *
FROM `producto`
JOIN `producto_categoria` ON `producto_categoria`.`categoria_id` = `producto`.`producto_categoria`
---
    public function getProductoAll(){
        $db = \Config\Database::connect();
        $builder = $db->table('producto');
        $builder->select('*');
                     //mi tabla producto_categoria , claveprimaria = clave foranea
        $builder->join('producto_categoria', 'producto_categoria.categoria_id = producto.producto_categoria');
        $query = $builder->get();